{"about_title":"About Me","contact_intro":"You can contact me directly through any of these links.","contact_send_btn":"Send a message","contact_title":"Contact","cv_text":"DOWNLOAD MY CV","first_text":"I began to awaken my passion for web development about 3 years ago. With the arrival of the pandemic, I started practicing with different technologies. I also worked for 1 year with a local company. My role was to create an interface for an electronic locker reservation page.","projects_country_text1":"In an app where you can consult the different countries by typing their name, or by name of the capital or continent.","projects_country_text2":"I had the opportunity to understand how Signals work in Angular in this app.","projects_gifs_text1":"In this app you can check different types of gifs thanks to a Giphy API call.","projects_gifs_text2":"It was the first time I used Angular so I learned how the code flow works when using it subscribe.","projects_intro":"Here you will find a variety of projects built in Angular, React, or Next.","projects_learn_text1":"It is an app where you can learn basic English through the documentation it provides.","projects_learn_text2":"The main feature is that you can do a 1 minute quiz to test what you have learned.","projects_learn_text3":"It was a great opportunity to create a small system.","projects_title":"Projects","projects_trailers_text1":"It's an app to search and watch movie trailers offered by a Youtube API.","projects_trailers_text2":"It was one of the first times I made calls to different APIs and with this one I decided to set up the front end.","projects_trello_text1":"It is an app for task management using customizable templates.","projects_trello_text2":"It was a great opportunity to learn how to use Next with server actions.","projects_trello_text3":"I keep all user infrmation with a cloud database on Neon.","projects_weather_text1":"It is an app to check the weather of any city in the world, in it you can see the temperature, wind speed, forecasts for the next hours.","projects_weather_text2":"It is one of my last applications making calls to different APIs.","second_text":"CURRENTLY, I STUDY ON MY OWN AND SEEK TO EXPAND MY CAREER OPORTUNITIES IN THE FIELD OF WEB DEVELOPMENT","technologies_basic_title":"Basic","technologies_cssLibraries_title":"CSS Libraries","technologies_htmlCssJs_explanation":"My experience in HTML allows me to effectively structure web content. Through CSS, I apply responsive and attractive designs, and with JavaScript, I manage dynamic interactions and API manipulation in my web projects.","technologies_intro":"A short explanation of what I can achieve in each of the technologies.","technologies_Pre_Processors_title":"Pre-Processors","technologies_reactAngular_explanation":"I have a solid understanding of both React and Angular. With React, I can create dynamic and efficient user interfaces, leveraging its component model, virtual DOM reconciliation, and the use of hooks. In Angular, I excel in building large-scale single-page applications, using its comprehensive framework based on TypeScript, with a deep understanding of modules, components, services, and routing.","technologies_sassLess_explanation":"I use Sass and Less in my web development because they offer an advanced syntax for CSS, allowing the use of variables, functions, and mixins, which simplifies and organizes the code. These preprocessors facilitate code reuse and maintenance, especially in large projects, by enabling a more concise and modular writing of style sheets","technologies_tailwindBootstrap_explanation":"I use Bootstrap to quickly build responsive user interfaces with its predefined components. On the other hand, I use Tailwind when I need granular control over the styling, as it provides a wide range of utility classes to build custom layouts.","technologies_title":"Technologies","technologies_typescriptRxjs_explanation":"I use TypeScript and RxJS in web development projects to leverage TypeScript's static typing and compile-time error detection, and to efficiently manage asynchronous data streams and events through the reactive programming facilitated by RxJS, thereby enhancing the robustness and maintainability of the code.","technologies_wordpressWoocommerce_explanation":"I have experience with the WordPress content management platform, enabling me to create attractive and functional websites. Additionally, I am familiar with WooCommerce, which allows me to build robust and customizable online stores, including product setup, payment methods, and shipping management.","writer_text":"WELLCOME TO MY PORTFOLIO AS A WEB DEVELOPER"}