{"technologies_basic_title":"Basic","technologies_cssLibraries_title":"CSS Libraries","technologies_htmlCssJs_explanation":"My experience in HTML allows me to effectively structure web content. Through CSS, I apply responsive and attractive designs, and with JavaScript, I manage dynamic interactions and API manipulation in my web projects.","technologies_intro":"A short explanation of what I can achieve in each of the technologies.","technologies_Pre_Processors_title":"Pre-Processors","technologies_reactAngular_explanation":"I have a solid understanding of both React and Angular. With React, I can create dynamic and efficient user interfaces, leveraging its component model, virtual DOM reconciliation, and the use of hooks. In Angular, I excel in building large-scale single-page applications, using its comprehensive framework based on TypeScript, with a deep understanding of modules, components, services, and routing.","technologies_sassLess_explanation":"I use Sass and Less in my web development because they offer an advanced syntax for CSS, allowing the use of variables, functions, and mixins, which simplifies and organizes the code. These preprocessors facilitate code reuse and maintenance, especially in large projects, by enabling a more concise and modular writing of style sheets","technologies_tailwindBootstrap_explanation":"I use Bootstrap to quickly build responsive user interfaces with its predefined components. On the other hand, I use Tailwind when I need granular control over the styling, as it provides a wide range of utility classes to build custom layouts.","technologies_title":"Technologies","technologies_typescriptRxjs_explanation":"I use TypeScript and RxJS in web development projects to leverage TypeScript's static typing and compile-time error detection, and to efficiently manage asynchronous data streams and events through the reactive programming facilitated by RxJS, thereby enhancing the robustness and maintainability of the code.","technologies_wordpressWoocommerce_explanation":"I have experience with the WordPress content management platform, enabling me to create attractive and functional websites. Additionally, I am familiar with WooCommerce, which allows me to build robust and customizable online stores, including product setup, payment methods, and shipping management."}