{"about_title":"Sobre mi","contact_intro":"Pots contactar amb mi directament a través de qualsevol d'aquests enllaços.","contact_send_btn":"Enviar un missatge","contact_title":"Contacte","cv_text":"DESCARREGA'T EL MEU CV","first_text":"Vaig començar a despertar la meva passió pel desenvolupament web fa uns 3 anys. Amb l'arribada de la pandèmia vaig començar a practicar amb diferents tecnologies. També vaig treballar durant 1 any amb una empresa local. La meva funció era crear una interfície per a una pàgina de reserva electrònica d'armaris.","projects_intro":"Aquí trobareu una varietat de projectes construïts en Angular, React o WordPress.","projects_title":"Projectes","second_text":"ACTUALMENT, ESTUDIO PER MEU PROPI I BUSCO AMPLIAR LES MEVES OPORTUNITATS DE CARRERA EN L'ÀMBIT DEL DESENVOLUPAMENT WEB","technologies_basic_title":"Bàsic","technologies_cssLibraries_title":"Biblioteques CSS","technologies_htmlCssJs_explanation":"La meva experiència en HTML em permet estructurar de manera efectiva el contingut web. A través de CSS, aplico dissenys responsius i atractius, i amb JavaScript, gestiono les interaccions dinàmiques i la manipulació d'API en els meus projectes web.","technologies_intro":"Una breu explicació del que puc aconseguir en cadascuna de les tecnologies.","technologies_Pre_Processors_title":"Preprocessadors","technologies_reactAngular_explanation":"Tinc una comprensió sòlida tant de React com d'Angular. Amb React, puc crear interfícies d'usuari dinàmiques i eficients, aprofitant el seu model de components, la reconciliació DOM virtual i l'ús de ganxos. A Angular, excel·lo en la creació d'aplicacions d'una sola pàgina a gran escala, utilitzant el seu marc complet basat en TypeScript, amb una comprensió profunda dels mòduls, components, serveis i encaminament.","technologies_sassLess_explanation":"Utilitzo Sass and Less en el meu desenvolupament web perquè ofereixen una sintaxi avançada per a CSS, que permet l'ús de variables, funcions i mixins, que simplifica i organitza el codi. Aquests preprocessadors faciliten la reutilització i el manteniment del codi, especialment en projectes grans, en permetre una escriptura més concisa i modular dels fulls d'estil.","technologies_tailwindBootstrap_explanation":"Utilitzo Bootstrap per crear ràpidament interfícies d'usuari sensibles amb els seus components predefinits. D'altra banda, faig servir Tailwind quan necessito un control granular sobre l'estil, ja que ofereix una àmplia gamma de classes d'utilitat per crear dissenys personalitzats.","technologies_title":"Tecnologies","technologies_typescriptRxjs_explanation":"Utilitzo TypeScript i RxJS en projectes de desenvolupament web per aprofitar l'escriptura estàtica i la detecció d'errors en temps de compilació de TypeScript, i per gestionar de manera eficient fluxos de dades i esdeveniments asíncrons mitjançant la programació reactiva facilitada per RxJS, millorant així la robustesa i el manteniment del codi.","technologies_wordpressWoocommerce_explanation":"Tinc experiència amb la plataforma de gestió de continguts WordPress, que em permet crear llocs web atractius i funcionals. A més, estic familiaritzat amb WooCommerce, que em permet crear botigues en línia robustes i personalitzables, inclosa la configuració del producte, els mètodes de pagament i la gestió d'enviaments.","writer_text":"BENVINGUTS AL MEU PORTFOLI COM A DESENVOLUPADOR WEB"}