{"about_title":"Acerca de mí","contact_intro":"Puedes contactar conmigo directamente a través de cualquiera de estos enlaces.","contact_send_btn":"Enviar un mensaje","contact_title":"Contacto","cv_text":"DESCARGAR MI CV","first_text":"Comencé a despertar mi pasión por el desarrollo web hace unos 3 años. Con la llegada de la pandemia comencé a practicar con diferentes tecnologías. También trabajé durante 1 año con una empresa local. Mi función era crear una interfaz para una página electrónica de reserva de casilleros.","projects_country_text1":"En una app donde podrás consultar los diferentes países escribiendo su nombre, o por nombre de la capital o continente.","projects_country_text2":"Tuve la oportunidad de entender cómo funcionan las señales en Angular en esta aplicación.","projects_gifs_text1":"En esta aplicación puedes consultar diferentes tipos de gifs gracias a una llamada a la API de Giphy.","projects_gifs_text2":"Fue la primera vez que usé Angular, así que aprendí cómo funciona el flujo de código al suscribirme.","projects_intro":"Aquí encontrará una variedad de proyectos creados en Angular, React o Next.","projects_learn_text1":"Es una app donde podrás aprender inglés básico a través de la documentación que proporciona.","projects_learn_text2":"La característica principal es que puedes realizar un cuestionario de 1 minuto para poner a prueba lo que has aprendido.","projects_learn_text3":"Fue una gran oportunidad para crear un pequeño sistema.","projects_title":"Proyectos","projects_trailers_text1":"Es una aplicación para buscar y ver avances de películas ofrecida por una API de Youtube.","projects_trailers_text2":"Fue una de las primeras veces que hice llamadas a diferentes API y con esta decidí configurar el front-end.","projects_trello_text1":"Es una aplicación para la gestión de tareas mediante plantillas personalizables.","projects_trello_text2":"Fue una gran oportunidad para aprender a utilizar Next con acciones del servidor.","projects_trello_text3":"Mantengo toda la información de los usuarios con una base de datos en la nube en Neon.","projects_weather_text1":"Es una app para consultar el clima de cualquier ciudad del mundo, en ella puedes ver la temperatura, velocidad del viento, pronósticos para las próximas horas.","projects_weather_text2":"Es una de mis últimas aplicaciones realizando llamadas a diferentes APIs.","second_text":"ACTUALMENTE ESTUDIO POR CUENTA Y BUSCO AMPLIAR MIS OPORTUNIDADES LABORALES EN EL ÁMBITO DEL DESARROLLO WEB","technologies_basic_title":"Básico","technologies_cssLibraries_title":"Bibliotecas CSS","technologies_htmlCssJs_explanation":"Mi experiencia en HTML me permite estructurar contenidos web de manera efectiva. A través de CSS aplico diseños responsive y atractivos, y con JavaScript administro interacciones dinámicas y manipulación de API en mis proyectos web.","technologies_intro":"Una breve explicación de lo que puedo lograr en cada una de las tecnologías.","technologies_Pre_Processors_title":"Preprocesadores","technologies_reactAngular_explanation":"Tengo un conocimiento sólido tanto de React como de Angular. Con React, puedo crear interfaces de usuario dinámicas y eficientes, aprovechando su modelo de componentes, la reconciliación DOM virtual y el uso de ganchos. En Angular, me destaco en la creación de aplicaciones de una sola página a gran escala, utilizando su marco integral basado en TypeScript, con un profundo conocimiento de módulos, componentes, servicios y enrutamiento.","technologies_sassLess_explanation":"Utilizo Sass y Less en mi desarrollo web porque ofrecen una sintaxis avanzada para CSS, permitiendo el uso de variables, funciones y mixins, lo que simplifica y organiza el código. Estos preprocesadores facilitan la reutilización y el mantenimiento del código, especialmente en proyectos grandes, al permitir una escritura más concisa y modular de hojas de estilo.","technologies_tailwindBootstrap_explanation":"Utilizo Bootstrap para crear rápidamente interfaces de usuario responsivas con sus componentes predefinidos. Por otro lado, uso Tailwind cuando necesito un control granular sobre el estilo, ya que proporciona una amplia gama de clases de utilidad para crear diseños personalizados.","technologies_title":"Tecnologías","technologies_typescriptRxjs_explanation":"Utilizo TypeScript y RxJS en proyectos de desarrollo web para aprovechar la tipificación estática y la detección de errores en tiempo de compilación de TypeScript, y para administrar de manera eficiente eventos y flujos de datos asincrónicos a través de la programación reactiva facilitada por RxJS, mejorando así la solidez y la mantenibilidad del código.","technologies_wordpressWoocommerce_explanation":"Tengo experiencia con la plataforma de gestión de contenidos WordPress, lo que me permite crear sitios web atractivos y funcionales. Además, estoy familiarizado con WooCommerce, que me permite crear tiendas en línea sólidas y personalizables, incluida la configuración de productos, métodos de pago y gestión de envíos.","writer_text":"BIENVENIDOS A MI PORTAFOLIO COMO DESARROLLADOR WEB"}